This material should help you get the ideas clearer from the first meeting:

In [1]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

# now in a dict:
data={'name':names, 'age':ages, 'girl':woman,'born In':country, 'degree':education}

#now into a DF
import pandas as pd

friends=pd.DataFrame.from_dict(data)
# seeing it:
friends

      name  age   girl  born In  degree
0    Tomás   32  False    Chile    Bach
1  Pauline   33   True  Senegal    Bach
2    Pablo   28  False    Spain  Master
3    Bjork   30  False   Norway     PhD
4     Alan   32  False     Peru    Bach
5    Juana   27   True     Peru  Master

The result is what you expected, but you need to be sure of what data structure you have:

In [ ]:
#what is it?
type(friends)

In [ ]:
#this is good
friends.age

In [ ]:
#what is it?
type(friends.age)

In [ ]:
#this is good
friends['age']

In [ ]:
#what is it?
type(friends['age'])

In [ ]:
#this is bad
friends.iloc[['age']]
#

In [ ]:
#this is bad
friends.loc[['age']]

In [ ]:
#this is bad
friends['age','born In']

In [ ]:
#this is good
friends[['age','born In']]

In [ ]:
# what is it?
type(friends[['age','born In']])

In [ ]:
#this is bad
friends.'born In'

In [ ]:
#this is good
friends.loc[:,['age','born In']]
#col tells pandas we want all rows, next only the specified columns

In [ ]:
type(friends.loc[:,['age','born In']])

In [ ]:
#this is bad
friends.loc[:,['age':'born In']]
#slice - age to born in; pandas doesn't know it

In [ ]:
#this is bad
friends.iloc[:,['age','born In']]

In [ ]:
# this is good (but different)
friends.iloc[:,1:4]

In [ ]:
# what is it?
type(friends.iloc[:,1:4])

In [ ]:
# this is good
friends.iloc[:,[1,3]]

In [ ]:
#what is it?
type(friends.iloc[:,[1,3]])

Most of our operations are done on Data frames, because they have several columns and we used that for the subsetting:

In [2]:
friends[friends.age>30]

      name  age   girl  born In degree
0    Tomás   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

Some people like coding with the filter language:

In [3]:
# 
filter1=friends.age>30
friends[filter1]
#traditional computer language

      name  age   girl  born In degree
0    Tomás   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

In [4]:
friends.where(filter1)
#if something is not in the value (filter) it creates a missing notation
#syntax: where replaces the square bracket but makes some changes to the data
#english programing 'language' - more readable

      name   age  girl  born In degree
0    Tomás  32.0   0.0    Chile   Bach
1  Pauline  33.0   1.0  Senegal   Bach
2      NaN   NaN   NaN      NaN    NaN
3      NaN   NaN   NaN      NaN    NaN
4     Alan  32.0   0.0     Peru   Bach
5      NaN   NaN   NaN      NaN    NaN

In [5]:
filter1a='age>30'
friends.query(filter1a)

      name  age   girl  born In degree
0    Tomás   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

In [ ]:
isinstance(friends[filter1], pd.DataFrame), \
isinstance(friends.where(filter1), pd.DataFrame), \
isinstance(friends.query(filter1a), pd.DataFrame)
#asking if these are all dataframes-- need to know what you have!
# use backslash to make it more readable-continue your line of code

When you have Boolean values (True/False) you can simplify:

In [6]:
#from:
friends[friends.girl==False]

    name  age   girl born In  degree
0  Tomás   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

In [7]:
# to...
friends[~friends.girl]

    name  age   girl born In  degree
0  Tomás   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

You can have two filters:

In [8]:
# this will not work
friends[~friends.girl & friends.degree=='Bach']

C:\Users\Jenni\Anaconda3\lib\site-packages\pandas\core\ops.py:1167: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

TypeError: invalid type comparison

In [9]:
# this will (with parentheses)
friends[(~friends.girl) & (friends.degree=='Bach')]

    name  age   girl born In degree
0  Tomás   32  False   Chile   Bach
4   Alan   32  False    Peru   Bach

Other times you want a values once a filter was applied:

In [ ]:
# youngest male:
friends[(~friends.girl) & (friends.age.min())] # this is wrong!
#you are making a filter here.

In [ ]:
friends[(~friends.girl) & (friends.age==friends.age.min())] # this is wrong too!
#syntax is fine, but semantics bad -- you're making a comparison (a filter, but a wrong one)
#the computer finds that there is no boy that is the youngest of the group.

In [10]:
friends.age.min()
#what is the minimum age of the group: 27.
#there is no boy with age of 27, which is why the one above this does not work

27

You got empty answer because there is no man aged 27.

In [11]:
# this is correct
friends[~friends.girl].age.min()

28

Once you know the right age, you have to put it in the right place:

In [12]:
friends[friends.age==friends[~friends.girl].age.min()]
#give me the friends with this qualifier;
#this is a good filter
#age of youngest male -- but we're asking for the whole dataframe, not just the boys
#give me someone who is the same age as the youngest boy (could have returned a girl)

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [13]:
# or
friends.where(friends.age==friends[~friends.girl].age.min())
#we're again asking for the whole dataframe
#using where() asks the whole df

    name   age  girl born In  degree
0    NaN   NaN   NaN     NaN     NaN
1    NaN   NaN   NaN     NaN     NaN
2  Pablo  28.0   0.0   Spain  Master
3    NaN   NaN   NaN     NaN     NaN
4    NaN   NaN   NaN     NaN     NaN
5    NaN   NaN   NaN     NaN     NaN

In [14]:
# or
friends.where(friends.age==friends[~friends.girl].age.min()).dropna()
#dropna() gets rid of rows with at least one missing value

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master

The problem is that 'friends' are not subset and the age keeps being that of the youngest woman:

In [ ]:
# bad:
friends.where(~friends.girl).where(friends.age==friends.age.min())
#where is giving us the whole dataframe

That's the advantage of **query**:

In [15]:
friends.query('~girl').query('age==age.min()')
#query operating on the last subset, or just the boys

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [16]:
#but

students=friends.copy()

students.where(~students.girl,inplace=True) #real subset
students.where(students.age==students.age.min())

    name   age  girl born In  degree
0    NaN   NaN   NaN     NaN     NaN
1    NaN   NaN   NaN     NaN     NaN
2  Pablo  28.0   0.0   Spain  Master
3    NaN   NaN   NaN     NaN     NaN
4    NaN   NaN   NaN     NaN     NaN
5    NaN   NaN   NaN     NaN     NaN

Let's vary the data a little:

In [17]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,28,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

# now in a dict:
data={'name':names, 'age':ages, 'girl':woman,'born In':country, 'degree':education}

#now into a DF
import pandas as pd

friends2=pd.DataFrame.from_dict(data)
# seeing it:
friends2

      name  age   girl  born In  degree
0    Tomás   32  False    Chile    Bach
1  Pauline   28   True  Senegal    Bach
2    Pablo   28  False    Spain  Master
3    Bjork   30  False   Norway     PhD
4     Alan   32  False     Peru    Bach
5    Juana   27   True     Peru  Master

There is a girl with the same age as the youngest boy, then:

In [18]:
friends2.where(friends2.age==friends2[~friends2.girl].age.min()).dropna()
#give me the age inputs that have the same value of youngest boy

      name   age  girl  born In  degree
1  Pauline  28.0   1.0  Senegal    Bach
2    Pablo  28.0   0.0    Spain  Master

We need a previous strategy:

In [ ]:
# bad implementation:
friends2.where(friends2.age==friends2[~friends2.girl].age.min() & friends2.girl==False).dropna()

In [ ]:
# bad implementation:
friends2.where(friends2.age==friends2[~friends2.girl].age.min() & ~friends2.girl).dropna()

In [19]:
# just parentheses to make it work!
friends2.where((friends2.age==friends2[~friends2.girl].age.min()) & (~friends2.girl)).dropna()

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master

This one still works!

In [20]:
friends2.query('~girl').query('age==age.min()')

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [ ]:
students2=friends2.copy()

students2.where(~students2.girl,inplace=True) #real subset
students2.where(students2.age==students2.age.min()).dropna()